#+TITLE:Iteration / exiting from loops
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 / Introduction to programming in C/C++ - Spring 2025
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:nil ^:nil num:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :exports both :results output :comments none
* Example

- Let's create an input file. We want to break a loop as soon as the
  number ~0~ is reached.

  #+begin_src bash :results output
    echo 10 9 8 7 6 5 4 3 2 1 0 > ../data/break_input
    cat ../data/break_input
  #+end_src

  #+RESULTS:
  : 10 9 8 7 6 5 4 3 2 1 0

- Here's some code: what does it do? What would happen without the
  ~break~ statement? Would you know how to test that?

  #+name: pgm:break
  #+begin_src C :cmdline < ../data/break_input :tangle ../src/breakInf.c
    int n;
    for (;;) {
      scanf("%d", &n);
      if (n == 0) break;
      printf("loop: n is %d\n", n);
     }
    printf("n is %d\n", n);
  #+end_src

  #+RESULTS: pgm:break
  #+begin_example
  loop: n is 10
  loop: n is 9
  loop: n is 8
  loop: n is 7
  loop: n is 6
  loop: n is 5
  loop: n is 4
  loop: n is 3
  loop: n is 2
  loop: n is 1
  n is 0
  #+end_example

- A good way to check/record an algorithm: pseudo code!

  Here is the pseudo code for the program *with* ~break~:
  #+name: pseudoBreak
  #+begin_example C
    for ever
        scan an integer
        if integer is 0
           break for loop
        else
           print the integer
    print the integer (0)
  #+end_example

  Here is the pseudo code for the program *without* ~break~:
  #+name: pseudoBreak
  #+begin_example C
    for ever
        scan an integer
        if integer is 0
           print the integer
  #+end_example

- Let's tangle the code and run it with/without the ~break~ on the
  command line.

* Example: summing up numbers.

The loop terminates when 10 non-zero numbers have been read. Whenever
the number ~0~ is read, ~continue~ is executed, the rest of the loop body
is skipped, but we're still inside the loop.

Input file:
#+begin_src bash
  echo 1 1 1 1 1 1 1 1 0 1 1 > continue
  cat continue
#+end_src

#+RESULTS:
: 1 1 1 1 1 1 1 1 0 1 1

Pseudo code:
#+begin_example C
while n smaller than 10
  get input i           // scanf
  if input is 0 go on   // continue
  else add input to sum // sum += i
  increment n           // n++
print sum               // printf
#+end_example

Code:
#+begin_src C :cmdline < ../data/continue
  int n=0, sum = 0;
  int i;

  while ( n < 10 ) {
    scanf("%d", &i);
    if ( i == 0 )
      continue;
    sum += i;
    n++;
    /* continue jumps to here */
   }
  printf("sum is %d\n", sum);
#+end_src

#+RESULTS:
: sum is 10

* The ~goto~ statement

- The ~goto~ statement can jump to /any/ statement in a function
  provided the function has a /label/.

- A /label/ is an identifier placed at the beginning of a statement
  (known to you from the ~switch...case~ selection statement):

  ~identifier : statement~

  A statement can have more than one label. The ~goto~ statement
  looks like this:

  ~goto identifier ;~

- Here is an example using ~goto~ to exit prematurely from a loop.

  The program looks for prime numbers.

  #+begin_src C
    int d, n = 3;
    for (d = 2; d < n; d++ )
      printf("%d\n", d);
    if (n % d == 0 )
      goto done;
    done:
    if (d < n)
      printf("%d is divisible by %d\n", n, d);
     else
       printf("%d is prime\n", n, d);
  #+end_src

  #+RESULTS:
  : 2
  : 3 is prime

- Once, the use of ~goto~ was very common, but programs with ~goto~
  statements tend to be hard to debug.

- A good use for ~goto~ is during debugging, because you can jump ship
  when an exception occurs, and run a small test routine (designing a
  function to do this is an alternative).

